{
  "breaking": [
    { "title": "Global Markets Rally Amid Economic Optimism" },
    { "title": "Western Alert: Severe Weather Expected Across Europe" },
    { "title": "Nigeria Political Update: Key Discussions With NLC Leaders" }
  ],
  "main": {
    "title": "Nigeria Political Update: Key Discussions With NLC Leaders",
    "summary": "President Tinubu and governors held crucial talks with NLC leaders to address national labor concerns.",
    "image": "main-story.jpg"
  },
  "nigeria": [
    {
      "title": "Christian Genocide Claims: US Congress Recommends Sanctions",
      "summary": "A report has been submitted detailing religious violence and proposing measures.",
      "image": "nigeria.jpg"
    },
    {
      "title": "2027 Polls: Vote-buying and Violence Threat to Legitimacy",
      "summary": "NPC warns about electoral risks and calls for safeguards.",
      "image": "nigeria2.jpg"
    },
    {
      "title": "Kano Cancer Centre Begins Oncology Training",
      "summary": "University collaboration aims to train nurses in oncology care.",
      "image": "kano-cancer.jpg"
    },
    {
      "title": "Why Egbetokun Resigned as IG – Presidency Statement",
      "summary": "Official statement provides reasons behind the Inspector General’s resignation."
    },
    {
      "title": "Wike Stood By Me Politically – Oshiomhole",
      "summary": "Former governor shares insights into political alliances."
    },
    {
      "title": "Abia Man in Police Net for Killing Girlfriend",
      "summary": "Law enforcement apprehends suspect in ongoing investigation."
    },
    {
      "title": "Kebbi Hails Army for Stopping Bandit Attacks",
      "summary": "Two local government areas secured against bandit threats."
    },
    {
      "title": "Why People Go Back to Sin After Ramadan – Al-Hikmah Chief Imam, Lafiagi",
      "summary": "Religious leader explains behavioral trends post-Ramadan."
    }
  ],
  "europe": [
    {
      "title": "EU Leaders Meet in Brussels",
      "summary": "Diplomatic talks continue to address economic and security concerns.",
      "image": "europe.jpg"
    }
  ],
  "africa": [
    {
      "title": "African Union Reviews Security Cooperation",
      "summary": "Leaders meet to strengthen cross-border security and development.",
      "image": "africa.jpg"
    }
  ],
  "asia": [
    {
      "title": "Asia-Pacific Economic Forum Discusses Growth",
      "summary": "Regional leaders gather to discuss trade and infrastructure investments.",
      "image": "asia.jpg"
    }
  ],
  "america": [
    {
      "title": "US Congress Submits Nigeria Report on Human Rights",
      "summary": "Recommendations include targeted sanctions and monitoring."
    }
  ],
  "politics": [
    {
      "title": "National Political Updates",
      "summary": "Ongoing political discussions shaping the country's future."
    }
  ],
  "business": [
    {
      "title": "Global Market Trends: Investors Eye Tech Sector",
      "summary": "Stocks surge as tech companies report strong quarterly earnings."
    }
  ],
  "music": [
    {
      "title": "Fido Apologises for Past Mistakes",
      "summary": "Artist releases official statement on social media."
    }
  ],
  "movies": [
    {
      "title": "New Nigerian Film Breaks Box Office Records",
      "summary": "Local cinema industry celebrates major milestone."
    }
  ],
  "olympics": [
    {
      "title": "2026 Winter Olympics Conclude in Italy",
      "summary": "The Milano Cortina 2026 Winter Games were successfully held across Italy, featuring exciting competitions in Milan, Cortina d’Ampezzo, and surrounding venues, with the closing ceremony at Verona Arena."
    }
  ]
}
