"main": {
  "title": "Tinubu Picks Disu for Pre-2027 Security Boost as DIGs Prepare to Retire",
  "summary": "President Bola Tinubu has approved strategic leadership adjustments within the police hierarchy as part of broader security reforms ahead of the 2027 general elections. Senior officers are expected to retire in the coming months as restructuring continues nationwide.",
  "image": "main-story.jpg"
      "title": "Alleged UK Property Fraud Case Filed by FG",
      "summary": "The Federal Government has filed fresh charges in a high-profile alleged property fraud case in the United Kingdom.",
      "image": ""
    },
    {
      "title": "Dangote Refinery to Distribute 65m Litres of Petrol",
      "summary": "Dangote Refinery signs a major supply agreement to distribute up to 65 million litres of petrol daily to domestic markets.",
      "image": ""
    },
    {
      "title": "Tax Reforms to Modernise and Boost the Economy",
      "summary": "New tax reforms aimed at modernising Nigeria’s revenue system and stimulating growth have been unveiled by government officials.",
      "image": ""
    }
  ],
  "europe": [
    {
      "title": "Ukraine Seeks Accelerated EU Accession Path by 2027",
      "summary": "Ukrainian President Zelenskyy urges European leaders to fast-track EU membership discussions for Ukraine amid ongoing conflict.",
      "image": ""
    },
    {
      "title": "European Leaders Pledge Continued Support for Kyiv",
      "summary": "EU representatives reaffirm long-term commitments to Ukraine’s defense and reconstruction support in summit statements.",
      "image": ""
    }
  ],
  "africa": [
    {
      "title": "Kenya Election Preparations Intensify",
      "summary": "With general elections approaching, Kenyan political parties ramp up campaigns and voter engagement efforts.",
      "image": ""
    },
    {
      "title": "South African Reserve Bank Reviews Interest Rate Policy",
      "summary": "The central bank is assessing its monetary stance as inflation pressures shift across the region.",
      "image": ""
    }
  ],
  "asia": [
    {
      "title": "Asian Markets Rally on Tech Sector Optimism",
      "summary": "Stocks in Tokyo, Seoul, and Shanghai surged as technology companies report strong earnings and AI investments grow.",
      "image": ""
    },
    {
      "title": "Iran-U.S. Nuclear Talks Continue in Geneva",
      "summary": "Negotiations between Iran and the United States resume in Geneva with diplomats hopeful for progress on nuclear compliance.",
      "image": ""
    }
  ],
  "america": [
    {
      "title": "U.S. Enacts New Global Tariffs on Key Imports",
      "summary": "New tariffs take effect as the U.S. aims to protect domestic industries, drawing mixed global economic responses.",
      "image": ""
    },
    {
      "title": "Severe Winter Storm Disrupts Northeastern Travel",
      "summary": "Heavy snow and high winds have grounded flights and delayed transit systems across the northeastern United States.",
      "image": ""
    }
  ],
  "politics": [
    {
      "title": "Ukraine Conflict Dominates European Diplomacy",
      "summary": "Political leaders across Europe emphasize continued assistance to Ukraine as tensions persist in the region.",
      "image": ""
    },
    {
      "title": "Global Trade Policies Under Scrutiny",
      "summary": "Trade experts comment on the impact of new tariffs and shifting economic priorities in international negotiations.",
      "image": ""
    }
  ],
  "business": [
    {
      "title": "Global Market Trends Mixed on New Trade Rules",
      "summary": "Economic analysts report uneven reactions in global markets following tariff announcements and central bank signals.",
      "image": ""
    },
    {
      "title": "Tech Investment Surges with Chip and AI Partnerships",
      "summary": "Major technology firms announce new semiconductor partnerships, boosting investor confidence in AI development.",
      "image": ""
    }
  ],
  "music": [
    {
      "title": "Global Streaming Hits Boost New Artist Breakouts",
      "summary": "Streaming charts show rising tracks from emerging artists across multiple regions as listeners explore fresh releases.",
      "image": ""
    },
    {
      "title": "Award Season Builds Momentum in Music Industry",
      "summary": "Major music award nominations and performances continue to shape the global entertainment calendar.",
      "image": ""
    }
  ],
  "movies": [
    {
      "title": "Oscars Season Spotlight and Festival Buzz",
      "summary": "Films gaining critical attention ahead of awards season draw global audiences and awards discussions.",
      "image": ""
    },
    {
      "title": "Streaming Platforms Expand Original Film Releases",
      "summary": "Major streaming services announce expanded film slates aiming to capture 2026 audiences.",
      "image": ""
    }
  ],
  "sports": [
    {
      "title": "International Leagues Resume Post-Olympics",
      "summary": "Football, basketball, and other global leagues return to full schedules following the Olympic break.",
      "image": ""
    },
    {
      "title": "World Cup Qualifiers and Championship Fixtures Announced",
      "summary": "Upcoming qualifiers for major tournaments are announced, energizing global fan bases.",
      "image": ""
    }
  ]
}


