{
  "main": {
    "title": "Tinubu Picks Disu for Pre-2027 Security Boost as DIGs Prepare to Retire",
    "summary": "President Bola Tinubu has approved strategic police leadership restructuring ahead of the 2027 elections. DIG Kayode Egbetokun confirmed that senior officers due for retirement will exit in phases as part of broader national security reforms.",
    "image": "main-story.jpg"
  },

  "nigeria": [
    {
      "title": "Alleged UK Property Fraud: Investigation Expands",
      "summary": "Nigerian anti-corruption authorities are reviewing fresh evidence linked to alleged overseas property fraud involving politically exposed individuals."
    },
    {
      "title": "Dangote Signs Deal to Distribute 65 Million Litres of Petrol",
      "summary": "Dangote Refinery has signed a nationwide distribution agreement expected to stabilize fuel supply and reduce import dependence."
    },
    {
      "title": "Tax Reforms to Modernise Nigeria’s Economy",
      "summary": "The Federal Government says ongoing tax reforms will widen the revenue base, improve compliance and strengthen economic growth."
    }
  ],

  "europe": [
    {
      "title": "EU Leaders Meet Over Energy Security",
      "summary": "European Union leaders held emergency talks in Brussels focused on gas reserves and long-term renewable energy transition."
    },
    {
      "title": "UK Inflation Shows Signs of Stabilising",
      "summary": "Latest economic data indicates inflation pressures in the United Kingdom may be easing after months of steady decline."
    }
  ],

  "africa": [
    {
      "title": "African Union Pushes Digital Trade Expansion",
      "summary": "The African Union announced new frameworks to boost cross-border digital payments across member states."
    },
    {
      "title": "Kenya Expands Renewable Energy Projects",
      "summary": "Kenyan authorities confirmed additional solar and wind investments aimed at cutting electricity costs."
    }
  ],

  "asia": [
    {
      "title": "China Announces New Economic Stimulus Measures",
      "summary": "Chinese officials introduced targeted fiscal policies to support manufacturing and technology sectors."
    },
    {
      "title": "India Strengthens Regional Trade Partnerships",
      "summary": "India signed new bilateral agreements to boost exports and regional infrastructure development."
    }
  ],

  "america": [
    {
      "title": "US Congress Debates Federal Budget Adjustments",
      "summary": "Lawmakers continue negotiations over spending priorities and economic recovery strategies."
    },
    {
      "title": "Canada Invests in Clean Technology Sector",
      "summary": "The Canadian government unveiled new incentives for green technology startups."
    }
  ],

  "politics": [
    {
      "title": "Global Leaders Call for Diplomatic Solutions",
      "summary": "International diplomats renewed calls for peaceful negotiations in ongoing geopolitical tensions."
    },
    {
      "title": "Election Monitoring Reforms Discussed Worldwide",
      "summary": "Several democracies are reviewing electoral processes to improve transparency and trust."
    }
  ],

  "business": [
    {
      "title": "Oil Prices Remain Stable in Global Markets",
      "summary": "Energy analysts report moderate stability in crude oil prices amid balanced supply forecasts."
    },
    {
      "title": "Tech Companies Expand AI Investments",
      "summary": "Major technology firms continue increasing artificial intelligence research funding."
    }
  ],

  "music": [
    {
      "title": "Afrobeats Continues Global Rise",
      "summary": "African music artists dominate streaming platforms as Afrobeats expands into new markets."
    },
    {
      "title": "International Tour Announcements Excite Fans",
      "summary": "Several global musicians revealed 2026 world tour schedules."
    }
  ],

  "movies": [
    {
      "title": "Major Studios Announce 2026 Film Releases",
      "summary": "Hollywood studios confirmed release dates for anticipated blockbuster films."
    },
    {
      "title": "Streaming Platforms Compete for Original Content",
      "summary": "Online platforms continue investing heavily in exclusive movie productions."
    }
  ],

  "sport": [
    {
      "title": "Post-Winter Sports Season Analysis Released",
      "summary": "Sports analysts review key performances following the conclusion of major winter competitions."
    },
    {
      "title": "Football Leagues Intensify Title Race",
      "summary": "European and African football leagues approach decisive stages as clubs battle for championship positions."
    }
  ]
}
