{
  "main": {
    "title": "Global Markets Rally as Central Banks Signal Stability",
    "summary": "Stock markets across major regions climbed today after central banks indicated a cautious but stable monetary policy outlook. Analysts say risk sentiment improved as inflation pressures show signs of easing.",
    "image": "main-story.jpg"
  },

  "nigeria": [
    {
      "title": "Strike Avoided as FG and Labour Resume Talks",
      "summary": "Organised labour and the Federal Government have agreed to continue negotiations after a threatened nationwide strike was suspended. Workers seek implementation of unpaid wage awards."
    },
    {
      "title": "Naira Holds Firm Against Naira ↔ USD Pressure",
      "summary": "Despite continued foreign exchange pressure, the Naira showed relative stability in the parallel market following CBN intervention."
    },
    {
      "title": "Senate Debates National Security Strategy",
      "summary": "The National Assembly engaged in discussions on strengthening domestic security frameworks ahead of the 2027 elections."
    },
    {
      "title": "FG and Germany Enhance Economic Cooperation",
      "summary": "Nigeria and Germany signed new agreements to deepen trade, technology and industrial collaboration."
    }
  ],

  "europe": [
    {
      "title": "EU Unveils New Climate Investment Plan",
      "summary": "European Union leaders approved a multi‑billion euro investment package to accelerate clean energy transition across member states."
    },
    {
      "title": "UK Retail Sales Show Surprising Resilience",
      "summary": "Latest figures revealed stronger‑than‑expected retail sales growth in the United Kingdom amid consumer spending shifts."
    }
  ],

  "africa": [
    {
      "title": "West African States Discuss Regional Economic Integration",
      "summary": "ECOWAS delegates met to explore coordinated market policies and improved cross‑border trade facilitation."
    },
    {
      "title": "South Africa Pledges Support for Renewable Expansion",
      "summary": "Government initiatives unveiled to encourage solar and wind infrastructure investment across the country."
    }
  ],

  "asia": [
    {
      "title": "Japan Announces Digital Innovation Grants",
      "summary": "Tokyo unveiled a series of grant programmes to support startups and digital transformation in key sectors."
    },
    {
      "title": "China Boosts Export Incentives Amid Trade Headwinds",
      "summary": "Beijing announced export support measures aimed at countering slowing external demand."
    }
  ],

  "america": [
    {
      "title": "US Jobs Report Shows Unexpected Strength",
      "summary": "The latest labour market data revealed stronger employment growth in the United States, lifting investor confidence."
    },
    {
      "title": "Canada Approves Major Infrastructure Funding",
      "summary": "Ottawa authorised new funding allocations for national infrastructure projects including transit and broadband."
    }
  ],

  "politics": [
    {
      "title": "Global Leaders Advocate Peaceful Resolutions",
      "summary": "International statesmen reiterated commitments to diplomatic pathways in ongoing geopolitical tensions at the annual summit."
    },
    {
      "title": "World Election Monitoring Best Practices Discussed",
      "summary": "Policy experts from multiple regions exchanged recommendations to enhance transparency in electoral systems."
    }
  ],

  "business": [
    {
      "title": "Oil Prices Extend Gains with Strong Demand Signals",
      "summary": "Crude oil benchmarks saw continued gains as demand forecasts strengthened in recent trade sessions."
    },
    {
      "title": "Tech Firms Announce AI Service Partnerships",
      "summary": "Large technology companies forged new agreements to expand artificial intelligence services and product offerings."
    }
  ],

  "music": [
    {
      "title": "Global Music Streams Reach New Highs",
      "summary": "Streaming platforms reported record listening figures, with emerging artists outperforming expectations."
    },
    {
      "title": "International Music Festivals Announce Lineups",
      "summary": "Major festivals revealed performance schedules featuring global headliners across multiple continents."
    }
  ],

  "movies": [
    {
      "title": "Film Festivals Highlight International Cinema",
      "summary": "Award‑season film festivals showcased groundbreaking work from emerging and established creators."
    },
    {
      "title": "Streaming Platforms Expand Global Film Reach",
      "summary": "Major streaming services confirmed international release plans for original films throughout 2026."
    }
  ],

  "sport": [
    {
      "title": "Super League and League Play Intensify Across Football",
      "summary": "Major football leagues across Europe and Africa entered critical stages with title and qualification battles underway."
    },
    {
      "title": "Global Athletics Federation Releases Calendar",
      "summary": "Plans were unveiled for the 2026 athletics season, including world championships and regional qualifiers."
    }
  ],

  "breaking": [
    { "title": "Central Banks Signal Monetary Stability, Markets Rally" },
    { "title": "Labour and FG Renew Dialogue to Avert Strike" },
    { "title": "Global Tech Partnerships Expand AI Services" }
  ]
}
