{
  "breaking": [
    {
      "title": "Nigeria: Tinubu meets governors and NLC leaders ahead of 2027 elections",
      "time": "Updated 24 Feb 2026"
    },
    {
      "title": "US Congress report recommends sanctions over alleged religious violence in Nigeria",
      "time": "Updated 24 Feb 2026"
    },
    {
      "title": "Europe marks four years since Russia-Ukraine conflict began",
      "time": "Updated 24 Feb 2026"
    }
  ],

  "main": {
    "title": "Global Political Tensions and Nigerian Electoral Talks Dominate Headlines",
    "summary": "World leaders continue diplomatic discussions as Europe marks four years of the Russia-Ukraine conflict. In Nigeria, President Bola Tinubu held strategic talks with state governors and Nigeria Labour Congress leaders as political alignments intensify ahead of the 2027 general elections. Electoral observers warn that vote-buying and political violence could threaten democratic credibility.",
    "image": "main-story.jpg"
  },

  "secondary": [
    {
      "title": "US Lawmakers Submit Report on Alleged Religious Violence in Nigeria",
      "summary": "Members of the US Congress have presented findings raising concerns about religious-based violence in Nigeria and recommending potential sanctions if accountability measures are not strengthened."
    },
    {
      "title": "Over 53,000 Nigerians Reportedly Held Without Trial",
      "summary": "Prison reform advocates highlight that tens of thousands of detainees remain behind bars without formal trial, sparking renewed calls for judicial reforms and faster case processing."
    },
    {
      "title": "Winter Paralympics Preparations Continue Amid Global Focus",
      "summary": "With the Winter Paralympics approaching, international attention remains on accessibility, athlete readiness, and geopolitical participation concerns."
    }
  ],

  "nigeria": [
    {
      "title": "El-Rufai Signals Strategic Political Realignment Ahead of 2027",
      "summary": "Former Kaduna Governor Nasir El-Rufai has hinted at broader consultations and coalition building as Nigeria’s 2027 political landscape begins to take shape."
    },
    {
      "title": "Wike Supported Me During Political Isolation — Oshiomhole",
      "summary": "Former Edo State Governor Adams Oshiomhole acknowledged Nyesom Wike’s backing during a period of political tension, reflecting ongoing alliance shifts."
    },
    {
      "title": "Presidency Explains Circumstances Around Egbetokun’s Exit as Inspector-General",
      "summary": "Officials provided clarification on the resignation of the former Inspector-General, citing institutional restructuring and policy direction."
    },
    {
      "title": "Security Forces Prevent Bandit Attacks in Kebbi LGAs",
      "summary": "The Kebbi State government commended the Nigerian Army for repelling attempted bandit operations in two local government areas."
    },
    {
      "title": "Abia Man Arrested Over Alleged Girlfriend Killing",
      "summary": "Police confirmed the arrest of a suspect in Abia State in connection with the death of a young woman, with investigations ongoing."
    },
    {
      "title": "Kano Cancer Centre Launches Oncology Training for Nurses",
      "summary": "A new collaboration between a cancer centre and a university in Kano has begun specialised oncology training to improve cancer care delivery."
    }
  ],

  "updates": [
    "2027 election talks intensify across Nigeria",
    "Electoral observers warn against vote-buying and violence",
    "US lawmakers raise concerns over religious security in Nigeria",
    "Winter Paralympics set for early March opening",
    "Prison reform debate resurfaces over prolonged detentions"
  ]
}
