{
  "main": {
    "title": "Breaking: Labour Suspends Strike Threat After Emergency Talks With FG",
    "summary": "Organised labour has temporarily suspended its planned nationwide strike following late-night negotiations with the Federal Government over unpaid wage awards. Talks are expected to continue as workers demand full implementation.",
    "image": "main-story.jpg"
  },

  "nigeria": [
    {
      "title": "Security Tightened Nationwide After Political Attack Outrage",
      "summary": "Security agencies increased surveillance in major cities following public outrage over the reported gun attack involving key political figures."
    },
    {
      "title": "Naira Shows Slight Recovery Amid FX Intervention",
      "summary": "The Naira recorded marginal gains in parts of the parallel market after fresh monetary policy signals from the Central Bank."
    },
    {
      "title": "Germany–Nigeria Trade Talks Advance",
      "summary": "Officials confirmed progress in bilateral economic discussions focusing on renewable energy, manufacturing and vocational training partnerships."
    },
    {
      "title": "National Assembly Cold War Deepens Over Leadership Disputes",
      "summary": "Internal disagreements among federal lawmakers intensified as factions debate committee restructuring and oversight powers."
    }
  ],

  "europe": [
    {
      "title": "EU Leaders Push New Defence Cooperation Plan",
      "summary": "European leaders unveiled a proposal aimed at strengthening joint defence production and strategic autonomy."
    },
    {
      "title": "UK Economy Shows Mixed Growth Signals",
      "summary": "Fresh data indicates modest economic expansion, though consumer confidence remains fragile."
    }
  ],

  "africa": [
    {
      "title": "ECOWAS Moves to Stabilise Sahel Region",
      "summary": "West African leaders discussed coordinated security responses and humanitarian support for affected communities."
    },
    {
      "title": "Kenya Expands Digital Finance Regulations",
      "summary": "Kenyan regulators introduced new compliance measures for fintech operators to improve consumer protection."
    }
  ],

  "asia": [
    {
      "title": "China Announces New Infrastructure Stimulus",
      "summary": "Authorities revealed additional public spending initiatives aimed at boosting domestic construction and technology sectors."
    },
    {
      "title": "India Strengthens Global Supply Chain Partnerships",
      "summary": "New trade corridors were announced to support export growth and manufacturing competitiveness."
    }
  ],

  "america": [
    {
      "title": "US Federal Reserve Signals Cautious Policy Path",
      "summary": "Officials indicated that interest rate adjustments will remain data-driven amid inflation monitoring."
    },
    {
      "title": "Latin American Markets Rally on Commodity Gains",
      "summary": "Improved global demand for agricultural exports boosted investor confidence across regional markets."
    }
  ],

  "politics": [
    {
      "title": "Global Leaders Call for Calm in Heightened Tensions",
      "summary": "Diplomatic channels intensified as international organisations urged peaceful engagement in ongoing disputes."
    },
    {
      "title": "Election Reform Debates Continue Worldwide",
      "summary": "Countries across multiple regions are reviewing electoral transparency laws ahead of major polls."
    }
  ],

  "business": [
    {
      "title": "Oil Prices Edge Higher in Global Trading",
      "summary": "Energy markets responded to supply expectations with modest upward price movements."
    },
    {
      "title": "Tech Firms Expand Artificial Intelligence Investments",
      "summary": "Major companies announced new AI infrastructure rollouts to remain competitive in the evolving digital economy."
    }
  ],

  "music": [
    {
      "title": "Afrobeats Streaming Hits New Milestone",
      "summary": "African music genres continued dominating global streaming platforms with record-breaking monthly listeners."
    },
    {
      "title": "International Awards Season Builds Momentum",
      "summary": "Artists worldwide prepare for major music award ceremonies scheduled later this year."
    }
  ],

  "movies": [
    {
      "title": "Box Office Rebounds With Early 2026 Releases",
      "summary": "Cinema attendance improved as several anticipated films premiered across global markets."
    },
    {
      "title": "Streaming Competition Intensifies",
      "summary": "Major platforms announced new original film projects to secure subscriber growth."
    }
  ],

  "sport": [
    {
      "title": "European Football Title Race Narrows",
      "summary": "Clubs across top European leagues enter decisive fixtures as championship battles intensify."
    },
    {
      "title": "African Nations Prepare for International Friendlies",
      "summary": "National teams stepped up training sessions ahead of upcoming international match windows."
    }
  ]
}
