{
  "main": {
    "title": "Global Headlines - 28 February 2026",
    "summary": "Catch up on today’s most important news stories around the world.",
    "image": "main-story.jpg"
  },
  "breaking": [
    { "title": "Naira drops to N1,395/$ in parallel market" },
    { "title": "Tinubu meets DIGs ahead of 2027 security boost" },
    { "title": "Labour sets Friday deadline to FG over unpaid wages" },
    { "title": "Germany eyes stronger economic ties with Nigeria" }
  ],
  "nigeria": [
    {
      "title": "Outrage greets gun attack on Peter Obi, Oyegun, others",
      "summary": "A violent attack on key political figures sparks national outrage and calls for increased security.",
      "image": ""
    },
    {
      "title": "Return tickets Aitedatutuwa: Ondo NASS members cold war deepens",
      "summary": "Disputes over ticket allocations have led to tensions within the Ondo state legislators.",
      "image": ""
    },
    {
      "title": "Labour gives Friday deadline to FG over 3-month unpaid wage award",
      "summary": "Labour unions warn of nationwide strike if wage arrears are not cleared.",
      "image": ""
    },
    {
      "title": "Sonore confronts Umahi at Force HQ over debt claim",
      "summary": "Dispute escalates between government agencies regarding debt repayments.",
      "image": ""
    },
    {
      "title": "Naira depreciates to N1,391/$ in parallel market",
      "summary": "The Nigerian currency sees further decline against the dollar, impacting imports and market prices.",
      "image": ""
    },
    {
      "title": "Germany eyes stronger economic ties with Nigeria",
      "summary": "Germany expresses interest in boosting trade, investment, and technology partnerships.",
      "image": ""
    }
  ],
  "europe": [
    {
      "title": "UK property fraud allegations rise",
      "summary": "Authorities investigate multiple high-value property fraud cases across London and Manchester.",
      "image": ""
    },
    {
      "title": "France imposes new tax reforms to boost economy",
      "summary": "The government aims to modernize fiscal policies and stimulate small business growth.",
      "image": ""
    },
    {
      "title": "Germany announces energy partnership with Scandinavia",
      "summary": "New cross-border energy deals will increase renewable electricity trade.",
      "image": ""
    }
  ],
  "africa": [
    {
      "title": "Brazil news under Africa: Regional trade summit concludes",
      "summary": "Leaders discuss improved trade routes between Africa and South America.",
      "image": ""
    },
    {
      "title": "Kenya launches new digital identity system",
      "summary": "The system aims to streamline government services and reduce corruption.",
      "image": ""
    }
  ],
  "asia": [
    {
      "title": "China releases new economic growth forecast",
      "summary": "The government projects modest GDP growth amid global market pressures.",
      "image": ""
    },
    {
      "title": "India imposes new cybersecurity regulations",
      "summary": "Companies must comply with stricter data protection standards.",
      "image": ""
    }
  ],
  "america": [
    {
      "title": "USA Senate debates major climate legislation",
      "summary": "Lawmakers push for ambitious renewable energy targets and emission reductions.",
      "image": ""
    },
    {
      "title": "Canada announces housing reforms in major cities",
      "summary": "Measures aim to tackle the rising cost of living and rental shortages.",
      "image": ""
    }
  ],
  "politics": [
    {
      "title": "Global political tensions rise over trade disputes",
      "summary": "Several countries engage in high-level talks to resolve economic conflicts.",
      "image": ""
    },
    {
      "title": "African Union proposes new election monitoring protocols",
      "summary": "Protocols aim to ensure transparency and fairness in upcoming elections.",
      "image": ""
    }
  ],
  "business": [
    {
      "title": "Dangote signs deal to distribute 65m litres petrol",
      "summary": "Business expansion expected to stabilize local fuel supply in Nigeria.",
      "image": ""
    },
    {
      "title": "Tech startups raise $1B globally this week",
      "summary": "Funding focuses on AI, fintech, and renewable energy sectors.",
      "image": ""
    }
  ],
  "music": [
    {
      "title": "Celebrity album releases dominate charts",
      "summary": "Top artists release new singles, driving streaming records worldwide.",
      "image": ""
    }
  ],
  "movies": [
    {
      "title": "Major film festival announces award winners",
      "summary": "Critically acclaimed films from multiple countries recognized for excellence.",
      "image": ""
    }
  ],
  "sport": [
    {
      "title": "Olympics planning committee announces upcoming events",
      "summary": "Preparations for future international sports events continue amid health guidelines.",
      "image": ""
    },
    {
      "title": "Local football leagues resume across Europe",
      "summary": "Fans return to stadiums as leagues implement safety protocols.",
      "image": ""
    }
  ]
}
