{
  "main": {
    "title": "Outrage Greets Gun Attack on Peter Obi, Oyegun and Others",
    "summary": "Political tensions rose nationwide after reports of a gun attack targeting Peter Obi, Chief John Oyegun and other political figures. Security agencies have launched investigations as leaders condemn the incident and call for calm.",
    "image": "main-story.jpg"
  },

  "nigeria": [
    {
      "title": "Return Ticket Crisis Deepens in Ondo and Nasarawa",
      "summary": "Political disagreements intensify in Ondo and Nasarawa states over return ticket decisions, with party factions entering a fresh cold war ahead of future elections."
    },
    {
      "title": "Labour Gives Friday Deadline Over Unpaid Wage Award",
      "summary": "Organised labour has issued a Friday ultimatum to the Federal Government demanding payment of the outstanding three-month wage award or risk nationwide industrial action."
    },
    {
      "title": "Sowore Confronts Umahi at Force Headquarters Over Debt Claim",
      "summary": "Activist Omoyele Sowore confronted Works Minister David Umahi at the Force Headquarters regarding allegations surrounding disputed debt claims."
    },
    {
      "title": "Naira Depreciates to N1,391/$ in Parallel Market",
      "summary": "The Naira weakened further in the parallel market, trading at N1,391 to the dollar amid persistent foreign exchange demand pressures."
    },
    {
      "title": "Germany Eyes Stronger Economic Ties With Nigeria",
      "summary": "German officials signaled renewed interest in expanding trade, renewable energy partnerships and manufacturing investments in Nigeria."
    }
  ],

  "europe": [
    {
      "title": "EU Strengthens Border Security Talks",
      "summary": "European Union leaders met in Brussels to review migration management strategies and regional stability measures."
    },
    {
      "title": "UK Business Confidence Improves Slightly",
      "summary": "New data suggests small recovery signals in the UK private sector as inflation stabilisation continues."
    }
  ],

  "africa": [
    {
      "title": "ECOWAS Reviews Regional Security Framework",
      "summary": "West African leaders met to assess joint military cooperation and counter-terrorism strategies."
    },
    {
      "title": "South Africa Announces Power Grid Reforms",
      "summary": "Authorities unveiled new electricity reforms aimed at reducing outages and boosting investor confidence."
    }
  ],

  "asia": [
    {
      "title": "China Expands Technology Investment Drive",
      "summary": "Beijing introduced new innovation incentives to strengthen semiconductor and AI manufacturing."
    },
    {
      "title": "Japan Boosts Defence Cooperation in Indo-Pacific",
      "summary": "Tokyo reaffirmed security partnerships amid rising regional geopolitical tensions."
    }
  ],

  "america": [
    {
      "title": "US Senate Debates Economic Reform Package",
      "summary": "Lawmakers continue discussions on fiscal policy adjustments aimed at stabilising growth."
    },
    {
      "title": "Canada Expands Clean Energy Funding",
      "summary": "Ottawa approved additional funding for renewable energy infrastructure projects."
    }
  ],

  "politics": [
    {
      "title": "Global Diplomats Call for De-escalation",
      "summary": "World leaders urged restraint in multiple regional conflicts during emergency consultations."
    },
    {
      "title": "Election Security Becomes Global Priority",
      "summary": "Several democracies announced new digital monitoring measures to strengthen election integrity."
    }
  ],

  "business": [
    {
      "title": "Oil Prices Show Mild Recovery",
      "summary": "Crude oil benchmarks posted modest gains amid supply balancing signals from major producers."
    },
    {
      "title": "Tech Sector Continues AI Expansion",
      "summary": "Global technology firms accelerate artificial intelligence infrastructure investment."
    }
  ],

  "music": [
    {
      "title": "Afrobeats Artists Dominate Global Charts",
      "summary": "African musicians continue expanding global audience reach across streaming platforms."
    },
    {
      "title": "Major World Tours Announced for 2026",
      "summary": "International artists revealed new tour dates spanning Europe, North America and Africa."
    }
  ],

  "movies": [
    {
      "title": "Streaming Platforms Increase Original Film Production",
      "summary": "Competition intensifies among streaming giants investing in exclusive 2026 releases."
    },
    {
      "title": "Film Festivals Spotlight Emerging African Directors",
      "summary": "Independent filmmakers gained international recognition at major global festivals."
    }
  ],

  "sport": [
    {
      "title": "Football Title Races Tighten Across Europe",
      "summary": "Major European leagues enter decisive stages as clubs battle for championship positions."
    },
    {
      "title": "African Nations Prepare for Continental Qualifiers",
      "summary": "National teams intensify preparations ahead of upcoming continental football competitions."
    }
  ]
}
