{
  "breaking": [
    {
      "title": "Tinubu meets governors and labour leaders ahead of 2027 elections",
      "time": "24 Feb 2026"
    },
    {
      "title": "Europe marks four years since start of Russia-Ukraine conflict",
      "time": "24 Feb 2026"
    },
    {
      "title": "Global markets react to new semiconductor investment deal",
      "time": "24 Feb 2026"
    }
  ],

  "main": {
    "title": "Political Realignments and Global Security Talks Shape World Headlines",
    "summary": "Leaders across Europe and Africa marked four years since the outbreak of the Russia-Ukraine conflict, renewing diplomatic calls for stability. In Nigeria, strategic meetings between President Bola Tinubu, state governors and labour representatives signal early positioning ahead of the 2027 elections. Meanwhile, economic analysts monitor fresh global investment shifts in the technology sector.",
    "image": "main-story.jpg"
  },

  "nigeria": [
    {
      "title": "El-Rufai Signals Coalition Discussions Ahead of 2027",
      "summary": "Former Kaduna governor Nasir El-Rufai has begun broader political consultations, indicating possible alliances as Nigeria approaches the next electoral cycle."
    },
    {
      "title": "US Congress Submits Report on Religious Violence Concerns",
      "summary": "American lawmakers presented findings highlighting alleged faith-based violence in Nigeria and proposed diplomatic consequences if accountability measures are not strengthened."
    },
    {
      "title": "Over 53,000 Detainees Reportedly Await Trial Nationwide",
      "summary": "Justice reform advocates raise concerns over prolonged detentions, urging faster judicial processing and prison system reforms."
    },
    {
      "title": "Kano Oncology Programme Trains Specialized Nurses",
      "summary": "A new partnership between a cancer centre and a university in Kano has launched advanced oncology training to strengthen healthcare delivery."
    }
  ],

  "europe": [
    {
      "title": "EU Leaders Renew Peace Commitments on War Anniversary",
      "summary": "European officials gathered for remembrance events and reaffirmed diplomatic efforts aimed at stabilizing Eastern Europe."
    },
    {
      "title": "Milan Fashion Week Highlights Economic Resilience",
      "summary": "Design houses presented Fall/Winter collections amid cautious optimism in the European luxury market."
    }
  ],

  "africa": [
    {
      "title": "West African Security Talks Focus on Regional Stability",
      "summary": "Defence ministers across West Africa discussed coordinated strategies to address insurgency and cross-border crime."
    },
    {
      "title": "Infrastructure Expansion Accelerates in East Africa",
      "summary": "Major transport and renewable energy projects continue to reshape trade corridors across the region."
    }
  ],

  "asia": [
    {
      "title": "Asian Markets Mixed Amid Technology Investment Surge",
      "summary": "Investors across major Asian exchanges reacted cautiously to new semiconductor supply agreements."
    },
    {
      "title": "Regional Climate Summit Pushes Adaptation Funding",
      "summary": "Leaders emphasized urgent climate resilience financing during a high-level environmental summit."
    }
  ],

  "america": [
    {
      "title": "US Prepares for Major Presidential Address",
      "summary": "Washington prepares for a high-profile national address focusing on economic recovery and foreign policy priorities."
    },
    {
      "title": "South American Trade Bloc Reviews Tariff Policies",
      "summary": "Regional ministers met to reassess trade frameworks aimed at strengthening economic cooperation."
    }
  ],

  "politics": [
    {
      "title": "Electoral Integrity Concerns Rise in Multiple Democracies",
      "summary": "Observers warn that misinformation, vote-buying and political intimidation remain global democratic challenges."
    },
    {
      "title": "Coalition Negotiations Intensify in Several African States",
      "summary": "Political parties continue behind-the-scenes negotiations ahead of upcoming national elections."
    }
  ],

  "business": [
    {
      "title": "Global Semiconductor Investment Deal Reshapes Market Outlook",
      "summary": "A major cross-border chip manufacturing agreement is expected to influence supply chains and technology pricing worldwide."
    },
    {
      "title": "Energy Prices Stabilize After Weeks of Volatility",
      "summary": "Oil and gas markets show signs of balance as geopolitical tensions ease slightly."
    }
  ],

  "music": [
    {
      "title": "Afrobeats Continues Global Streaming Growth",
      "summary": "African music genres record increased digital streaming numbers across Europe and North America."
    },
    {
      "title": "International Artists Announce 2026 World Tours",
      "summary": "Major performers revealed multi-continent tour schedules, boosting the live entertainment sector."
    }
  ],

  "movies": [
    {
      "title": "Award Season Builds Momentum Ahead of Spring Ceremonies",
      "summary": "Film industry analysts predict competitive races across major acting and directing categories."
    },
    {
      "title": "Streaming Platforms Expand Original Content Budgets",
      "summary": "Studios continue investing heavily in global productions to meet rising subscriber demand."
    }
  ],

  "olympics": [
    {
      "title": "France Advances Planning for 2030 Winter Olympics",
      "summary": "Infrastructure reviews and venue assessments continue as France prepares long-term delivery strategies."
    },
    {
      "title": "Winter Paralympics Preparations Near Final Phase",
      "summary": "Organizers confirm readiness across multiple host venues ahead of the upcoming international competition."
    }
  ]
}
