{
  "breaking": [
    { "title": "Global Markets Rally Amid Economic Optimism" },
    { "title": "Olympics 2026: Lille Prepares for Opening Ceremony" },
    { "title": "Western Alert: Severe Weather Expected Across Europe" }
  ],
  "main": {
    "title": "Nigeria Political Update: Key Discussions With NLC Leaders",
    "summary": "President Tinubu and governors held crucial talks with NLC leaders to address national labor concerns.",
    "image": "main-story.jpg"
  },
  "nigeria": [
    {
      "title": "Christian Genocide Claims: US Congress Recommends Sanctions",
      "summary": "A report has been submitted detailing religious violence and proposing measures.",
      "image": "nigeria.jpg"
    },
    {
      "title": "2027 Polls: Vote-buying and Violence Threat to Legitimacy",
      "summary": "NPC warns about electoral risks and calls for safeguards.",
      "image": "nigeria2.jpg"
    },
    {
      "title": "UK Ex-envoy Mandelson Released on Bail in Epstein Case",
      "summary": "Former diplomat released after legal proceedings in the UK.",
      "image": "uk.jpg"
    },
    {
      "title": "Why Egbetokun Resigned as IG – Presidency Statement",
      "summary": "Official statement provides reasons behind the Inspector General’s resignation."
    }
  ],
  "europe": [
    {
      "title": "EU Leaders Meet in Brussels",
      "summary": "Diplomatic talks continue to address economic and security concerns.",
      "image": "europe.jpg"
    }
  ],
  "africa": [
    {
      "title": "Kebbi Hails Army for Stopping Bandit Attacks",
      "summary": "Two local government areas secured against bandit threats.",
      "image": "africa.jpg"
    }
  ],
  "asia": [
    {
      "title": "Kano Cancer Centre Begins Oncology Training",
      "summary": "University collaboration aims to train nurses in oncology care.",
      "image": "asia.jpg"
    }
  ],
  "america": [
    {
      "title": "US Congress Submits Nigeria Report on Human Rights",
      "summary": "Recommendations include targeted sanctions and monitoring."
    }
  ],
  "politics": [
    {
      "title": "Wike Stood By Me Politically – Oshiomhole",
      "summary": "Former governor shares insights into political alliances."
    }
  ],
  "business": [
    {
      "title": "Global Market Trends: Investors Eye Tech Sector",
      "summary": "Stocks surge as tech companies report strong quarterly earnings."
    }
  ],
  "music": [
    {
      "title": "Fido Apologises for Past Mistakes",
      "summary": "Artist releases official statement on social media."
    }
  ],
  "movies": [
    {
      "title": "New Nigerian Film Breaks Box Office Records",
      "summary": "Local cinema industry celebrates major milestone."
    }
  ],
  "olympics": [
    {
      "title": "Olympics 2026: Lille Prepares for Opening Ceremony",
      "summary": "Final touches underway as athletes arrive in France.",
      "image": "olympics.jpg"
    }
  ]
}
